Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/Forms/ФормаАлгоритмОбработчикаСобытий/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ТипАлгоритма", 			ТипАлгоритма);
	Параметры.Свойство("Алгоритм", 				Алгоритм);
	Параметры.Свойство("ИмяОбъектаМетаданных", 	ИмяОбъектаМетаданных);
	Параметры.Свойство("ТипТаблицы", 			ТипТаблицы);
	Параметры.Свойство("ИмяТабличнойЧасти", 	ИмяТабличнойЧасти);
	Параметры.Свойство("ИмяСоздаваемогоДокумента", ИмяСоздаваемогоДокумента);
    Параметры.Свойство("ИмяМетаданныхСоздаваемогоДокумента", ИмяМетаданныхСоздаваемогоДокумента);
	
	Если Не ПроверитьЗаполнениеПараметровПриСозданииНаСервере(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьИнформациюАлгоритмаПриСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗакрытьБезСохранения(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)

	ПараметрыЗакрытия = Новый Структура();
	
	ПараметрыЗакрытия.Вставить("ТипАлгоритма", 		ТипАлгоритма);
	ПараметрыЗакрытия.Вставить("Алгоритм", 			Алгоритм);
	ПараметрыЗакрытия.Вставить("ТипТаблицы", 		ТипТаблицы);
	ПараметрыЗакрытия.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ПараметрыЗакрытия.Вставить("ИмяСоздаваемогоДокумента", ИмяСоздаваемогоДокумента);
	ПараметрыЗакрытия.Вставить("ИмяМетаданныхСоздаваемогоДокумента", ИмяМетаданныхСоздаваемогоДокумента);
	
	Закрыть(ПараметрыЗакрытия);	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенным(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПредопределеннымПослеПодтверждения", ЭтотОбъект);
	
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Произвольный алгоритм будет очищен и заполнен предопределенным. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьЗаполнениеПараметровПриСозданииНаСервере(Отказ)
	
	Если Не ЗначениеЗаполнено(ИмяОбъектаМетаданных) Тогда
		Отказ = Истина;
	Иначе
	
		Если ВРег(ТипАлгоритма) = ВРег("ОбработкаСтрокиТабличнойЧасти") Тогда
			
			Если ТипТаблицы.Пустая() Или Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
				Отказ = Истина;
			Иначе
				ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти";
			КонецЕсли;
			
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("АлгоритмОбработкиСозданияДокументаНаОсновании") Тогда
			ТипАлгоритма = "ОбработкаСозданияДокументаНаОсновании";	
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("ПередЗаписью") Тогда
			ТипАлгоритма = "ПередЗаписью";
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("ПослеЗаписи") Тогда
			ТипАлгоритма = "ПослеЗаписи";
		Иначе
			Отказ = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		МетаданныеДокумента = Метаданные.Документы.Найти(ИмяОбъектаМетаданных);
		
		Если МетаданныеДокумента = Неопределено Тогда
			Отказ = Истина;
		Иначе
			
			ИмяОбъектаМетаданных = МетаданныеДокумента.Имя;
			
			Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
				
				МетаданныеТабличнойЧасти = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
				
				Если МетаданныеТабличнойЧасти = Неопределено Тогда
					Отказ = Истина;
				Иначе
					ИмяТабличнойЧасти = МетаданныеТабличнойЧасти.Имя;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьИнформациюАлгоритмаПриСозданииНаСервере()
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяОбъектаМетаданных);
	
	//@skip-check new-font
	ШрифтТекстаЗаголовка 			= Новый Шрифт(, 13);
	//@skip-check new-font
	ШрифтТекстаОписания 			= Новый Шрифт(, 11);
	//@skip-check new-font
	ШрифтТекстаЗаголовкаПеременных	= Новый Шрифт(, 10);
	//@skip-check new-font
	ШрифтТекстаПеременных 			= Новый Шрифт(, 9, , , Истина);
	//@skip-check new-font
	ШрифтТекстаОписанияПеременных 	= Новый Шрифт(, 9);
	
	ЦветТекстаЗаголовков 			= WebЦвета.Зеленый;
	ЦветТекстаПеременных 			= WebЦвета.Синий;
	
	ИнформацияОбАлгоритме = Новый Массив();
	ИнформацияОписаниеПеременных = Новый Массив();
	
	ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступные переменные:'"), ШрифтТекстаЗаголовкаПеременных, ЦветТекстаЗаголовков));
	
	Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
		
		МетаданныеТабличнойЧасти = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: Обработка строки табличной части ""%2""'"), 
			МетаданныеДокумента.Синоним, МетаданныеТабличнойЧасти.Синоним);
			
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый после обновления данных в строке табличной части %1 документа %2'"), 
				МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый после обновления данных в строке табличной части %1 документа %2 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
			
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ТекущаяСтрока'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Строка табличной части %1 объекта документа %2'"), 
			МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
	ИначеЕсли ТипАлгоритма = "ОбработкаСозданияДокументаНаОсновании" Тогда
				
		Заголовок = СтрШаблон(НСтр("ru = '%1: Обработка создания документа на основании ""%2""'"), 
			ИмяСоздаваемогоДокумента, МетаданныеДокумента.Синоним);
			
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый при создании документа  %1'"), 
				ИмяСоздаваемогоДокумента), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый при создании документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			ИмяСоздаваемогоДокумента), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), ИмяСоздаваемогоДокумента), 
			ШрифтТекстаОписанияПеременных
		));
		
	ИначеЕсли ТипАлгоритма = "ПередЗаписью" Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: Перед записью'"), МетаданныеДокумента.Синоним);
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый перед записью документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый перед записью документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
	
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), МетаданныеДокумента.Синоним),
			ШрифтТекстаОписанияПеременных
		));
			
	ИначеЕсли ТипАлгоритма = "ПослеЗаписи" Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: После записи'"), МетаданныеДокумента.Синоним);

		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый после записи документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый после записи документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументСсылка'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Ссылка документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
		
	КонецЕсли;

	Элементы.ИнформацияОбАлгоритме.Заголовок = Новый ФорматированнаяСтрока(ИнформацияОбАлгоритме);
	Элементы.ИнформацияОписаниеПеременных.Заголовок = Новый ФорматированнаяСтрока(ИнформацияОписаниеПеременных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределеннымПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Алгоритм = "";
	
	Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
		Алгоритм = SUI_НастройкиДокументовКлиентСервер.ПолучитьПроизвольныйАлгоритмОбработкиСтрокДокумента(ПараметрыПолученияПроизвольногоАлгоритма());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПолученияПроизвольногоАлгоритма()
	
	ПараметрыПолученияАлгоритма = Новый Структура();
	
	ПараметрыПолученияАлгоритма.Вставить("ИмяОбъектаМетаданных", 	ИмяОбъектаМетаданных);
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоТовары");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоОтбор");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоРазмещение");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоШтрихкодыУпаковок");
	КонецЕсли;
	
	Возврат ПараметрыПолученияАлгоритма;
	
КонецФункции

#КонецОбласти
